{
  "computer_vision": [
    {
      "image": "/media/projects/computer_vision/vizpol.gif",
      "title": "VizPol: Real-Time Symbol Recognition for Field Reporting and Image Tagging",
      "date": "April '19 - Present",
      "description": "VizPol is an app designed to provide journalists with contextual information about unfamiliar graphic symbols they may encounter during field reporting, especially during live events, protests, and rallies. By offering journalists some additional information about these symbols (or just alerting them to the fact that a symbol may have broader political connotations) the VizPol app supports more accurate, effective reporting on an increasingly complex political landscape. It has been covered in <i>The Economist</i> and other publications.",
      "link": "https://vizpolresearch.medium.com/about-3ed0d6d6d64c",
      "open_direct": true
    },
    {
      "image": "/media/projects/computer_vision/cats_cradle.jpg",
      "title": "Lilla LoCurto & Bill Outcault: Much Madness is divinest Sense",
      "date": "August '18 - March '19",
      "description": "I helped Brooklyn based artists Lilla LoCurto and Bill Outcault with an installation called <i>cat's cradle</i>, a contemporary, animated recreation of Hiram Powers' <i>The Greek Slave</i>, as part of their exhibition at the Neuberger Museum of Art in Purchase, NY, <i>Much Madness is Divinest Sense</i>. I helped with the sculpture's hardware and Computer Vision algorthim that detected the people it was interacting with.",
      "link": "https://www.purchase.edu/live/news/3150-lilla-locurto-bill-outcault-much-madness-is",
      "open_direct": true
    },
    {
      "image": "/media/projects/computer_vision/refexp.gif",
      "title": "Semantically Aware Objective Function for Referring Expression Generation",
      "date": "September '17 - May '18",
      "description": "Referring Expression Generation is a Machine Learning problem where, given an image with some objects and a bounding box around one of those objects, the ML system generates a natural language expression to uniquely identify that object. My team and I attempted to replace the objective function of the existing state of the art system for this problem with an objective function that places more emphasis on the semantic meaning of the expressions in the training data.",
      "image_citation": "Image taken from Yu et al [2016], <a href='https://arxiv.org/abs/1608.00272' target='_blank'> <i>Modeling Context in Referring Expressions</i> </a>",
      "link": "/projects/computer_vision/refexp-2.pdf"
    }
  ],
  "natural_language_processing" : [
    {
      "image": "/media/projects/natural_language_processing/nyla.png",
      "title": "New York Live Art's Hack-Art-Thon",
      "date": "May '19",
      "description": "I worked with Bangladeshi-Czech dancer and choreographer Esther Siddiquie on an artistic subway campaign to encourage normalizing conversations about mental health. My role in this was to conceptualize an algorithm that could generate captions for the images by training on real accounts of people publicly posting about mental health challenges.",
      "image_citation": "Image: <a href='https://newyorklivearts.org/' target='_blank'>New York Live Arts</a>",
      "link": "https://newyorklivearts.org/artist/ishaan-esther/"
    },
    {
      "image": "/media/projects/natural_language_processing/convokit.png",
      "title": "Cornell Conversation Analysis Toolkit",
      "date": "August '17 - December '17",
      "description": "I have been refactoring code and writing example scripts for some of the functionality provided by the <a href='https://github.com/CornellNLP/Cornell-Conversational-Analysis-Toolkit' target='_blank'> Cornell Conversation Analysis Toolit</a>. Particularly the code for the model presented in the <a href='https://www.cs.cornell.edu/~cristian/Asking_too_much.html' target='_blank'>\"Asking Too Much?\"</a> paper that given a corpus of questions, clusters them by similar \"type\".",
      "image_citation": "Image taken from <a href='https://dosideas.com/noticias/motivacion/890-guia-para-mantener-una-conversacion-efectiva' target='_blank'>DosIdeas</a>"
    },
    {
      "image": "/media/projects/natural_language_processing/alexa.png",
      "title": "Conversation AI for Alexa Challenge",
      "date": "September '16 - October '16",
      "description": "Amazon's annual <a href='' target='_blank'> Alexa Prize </a> competition funds a select few proposals for chatbots built on its Alexa engine. Our proposal didn't end up making it, but my team and I still learnt a lot about Information Extraction and Long Short Term Memory netwoks (LSTMs) through the research we did for our proposal.",
      "image_citation": "Image taken from <a href='https://lifehacker.com/the-alexa-skills-that-are-actually-worth-using-1791616099' target='_blank'> Lifehacker </a>",
      "link": "/projects/natural_language_processing/alexa_challenge.pdf"
    },
    {
      "image": "/media/projects/natural_language_processing/wsd.png",
      "title": "Word Sense Disambiguation",
      "date": "October '15 - November '15",
      "description": "A partner and I built a Word Sense Disambiguation model that was ranked 4/96 in <a href='https://www.kaggle.com/c/wsd-fall2015' target='_blank'> this Kaggle Challenge<a>. ",
			"link": "/projects/natural_language_processing/wsd.pdf",
      "image_citation": "Image created on <a href='https://worditout.com/word-cloud/create' target='_blank'>WordItOut</a>"
    }
  ],
  "rapid_prototyping": [
    {
      "image": "/media/projects/rapid_prototyping/graffitibot.gif",
      "title": "GraffitiBot",
      "date": "August '16 - December '16",
      "description": "GraffitiBot is a portable device that can be used to create art in public places. It can be mounted easily on a wall by attaching its two constituent pulleys to the wall. It can draw any line image fed to its arduino controller.",
      "link": "/projects/rapid_prototyping/graffitibot.html"
    },
    {
      "image": "/media/projects/rapid_prototyping/zoetrope.gif",
      "title": "Electric Zoetrope",
      "date": "December '17",
      "description": "From <a href='https://en.wikipedia.org/wiki/Zoetrope' target='_blank'>Wikipedia</a>:\"A zoetrope is one of several pre-film animation devices that produce the illusion of motion by displaying a sequence of drawings or photographs showing progressive phases of that motion.\" I attempted to prototype an \"electric\" zoetrope based on Akinori Goto's <a href='https://vimeo.com/user16179491' target='_blank'>art</a>.",
      "link": "/projects/rapid_prototyping/zoetrope.html"
    },
    {
      "image": "/media/projects/rapid_prototyping/cryptex.png",
      "title": "Cryptex",
      "date": "December '16",
      "description": "A cryptex is a simple device comprised of an inner and outer hollow cylinder. The inner cylinder goes into the outer one and is held in place by several rings with numbers on them. Only when the numbers are set to the correct password will the rings be configured in a way that allows free movement of the inner cylinder out of the outer cylinder. The inner cylinder could store something precious, like a message or a small meaningful object.",
      "link": "/projects/rapid_prototyping/cryptex.html"
    }
  ],
  "security" : [
    {
      "image": "/media/projects/security/dave.png",
      "title": "Dave - Secure Notes Server for Journalists Reporting in Places they might be Persecuted",
      "date": "January '18 - Present",
      "description": "Our system serves journalists who want to be able to write about a region/person/group without the risk of being incriminated for it or compromising the data that they collect. They can access this system via a VPN and write notes on it so that the notes cannot be accessed from their physical laptops. They can also \"archive\" any of their notes, rendering them completely inaccessible to anyone other than project managers at the journalism organization's headquarters.",
      "image_citation": "Image taken from <a href='http://allafrica.com/view/group/main/main/id/00042873.html' target='_blank'>AllAfrica</a>"
    }
  ],
  "networks" : [
    {
      "image": "/media/projects/networks/social_network.png",
      "title": "Measuring Online Influence in the Brexit Debate",
      "date": "March '18 - Present",
      "description": "I worked with a dataset that consists of UK-based Facebook users’ interactions with the posts made by different political parties, ranging from the far left to the far right. I measured the different approaches people took to driving their agenda in the Brexit vote.",
      "image_citation": "Image taken from <a href='https://www.interworks.com/fr/blog/nlaurenti/2014/10/20/brief-history-graphs' target='_blank'>InterWorks</a>",
      "link": "/projects/networks/brexit.pdf"
    }
  ],
  "visual" : [
    {
      "image": "/media/projects/visual/passport_power.gif",
      "title": "Passport Power",
      "date": "March '15 - April '15",
      "description": "Our world map visualization explores the power of passports. Upon clicking, you can see the country being selected highlight in neon yellow. The lines that shoot out from this country lead to the countries somoene holding a passport from this country can visit without a visa.",
      "link": "/projects/visual/passport_power.html"
    },
    {
      "image": "/media/projects/visual/dmitri.gif",
      "title": "Dmitri - 3D Printing Visualizer",
      "date": "February '17 - May '18",
      "description": "For a class project a group and I made a 3D printing file editor and visualizer for <a href='http://eship.dyson.cornell.edu/blog/2017/02/24/dimitri-giving-you-the-power-to-create/' target='_blank'>Dmitri</a>. My role in the project was the visualizer part. I used THREE.js to implement a rapidly sped up visualiztion of what actually happens inside the 3D printer.",
      "link":"/projects/visual/dmitri.html"
    },
    {
      "image": "/media/projects/visual/delaney.png",
      "title": "Sci Fi Topic Model Viewer",
      "date": "March '17",
      "description": "For a class on Science Fiction and Utopia/Dystopia I made a small visual tool based on David Mimno's <a href='http://www.mimno.org/wordsim/nearest.html' targe='_blank'>wordsim</a> that facilitates a topic modeling analysis of a corpus of 267 Science Fiction texts.",
      "link": "/projects/visual/delaney.html"
    }
  ],
  "game_design": [
    {
      "image": "/media/projects/game_design/deserted.gif",
      "title": "Deserted",
      "date": "January '16 - May '16",
      "description": "Deserted takes place in a fantastical desert empire, where select humans can form pacts with spirits of a separate realm. Meeting a wide array of spirits and spirit users, join young Dara on a journey to achieve victory in the spirit user tournament and join the spirit masters. Use strategic planning and calculated risk to reign victorious in this fantasy turn-based tactics game.",
      "link": "http://gdiac.cis.cornell.edu/gallery/download.php?name=deserted"
    },
    {
      "image": "/media/projects/game_design/click_game.png",
      "title": "Reaction Time Game",
      "date": "October '16",
      "description": "This game rewards quick reaction time. To start the game either player can push their button. A starting tone will play and the LED will blink green for a few seconds, indicating that the game has now begun. Henceforth, when the LED flashes green, the players have to race to click on their button - whoever clicks first gets a point signaled by the LED changing to the color of that player's button. If you click without seeing the LED flash green you hear a reprimanding tone and the opposing team gets a point - signaled again by the LED changing to the opposing team’s color. The first team to 5 points wins - and when this happens a winning tone is played accompanied by the LED blinking the winning team’s color for a few seconds.",
			"link": "/projects/game_design/click_game.html"
    },
    {
      "image": "/media/projects/game_design/simple_bball_game.png",
      "title": "Simple Basketball Game",
      "date": "April '20'",
      "description": "A simple Basketball game that is more an opportunity to play with d3's force module than anything else",
      "link": "/projects/game_design/simple_bball_game.html"
    }
  ],
  "other" : [
    {
      "image": "/media/projects/other/critterworld.gif",
      "title": "Critterworld",
      "date": "January '14 - May '14",
      "description": "Critterworld is a simulation of a world on a hexagonal grid whose inhabitants, \"critters\" walk around, eat their dead fellows, mate and fight. This was a class project designed to familiarize me and a partner with data structures, algorithms, parsing grammars, graphical user interfaces and distributed computing"
    },
    {
      "image": "/media/projects/other/os_prac.jpg",
      "title": "Operating System From Scatch",
      "date": "September '15 - December '15",
      "description": "A partner and I built an operating system modeled off UNIX. We implemented the process abstraction, multitasking, threads, clock, alarms, the scheduler, error handling, memory management, TCP/IP networking and a UNIX-like file system among other features.",
      "image_citation": "Image taken from <a href='https://www.youtube.com/watch?v=5AjReRMoG3Y' target='_blank'>OpenCanvas YouTube channel</a>"
    },
    {
      "image": "/media/projects/other/xi.png",
      "title": "Compiler for \"Xi\"",
      "date": "September '16 - December '16",
      "description": "A group of three others and I built a compiler for a pseudo-object oriented language \"Xi\". We implemented lexincal analysis, syntactic analysis (parsing), intermediate code generation, assembly code generation and optimization among other features.",
      "image_citation": "Image taken from <a href='https://hackernoon.com/compilers-and-interpreters-3e354a2e41cf' target='_blank'>Faiçal Tchirou on Hacker Noon</a>"
    },
    {
      "image": "/media/projects/other/snps.png",
      "title": "Genetic Variation in A Natural Population",
      "date": "June '15 - December '16",
      "description": "I worked with a Computational Biology lab at Cornell to investigate the population genetics question, \"What can alleles on certain Single Nucleotide Polymorphisms (SNPs) with anomalous p-values calculated using Gene Dropping (GD) techniques tell us about genetic variation in a natural population?\". You can see my code <a href='https://github.com/iaj8/clark_lab/tree/cs4775_final/cs4775_final' target='_blank'>here</a>.",
      "link":"/projects/other/snps.pdf",
      "image_citation": "Image taken from Macluer et al [1986], <a href='http://onlinelibrary.wiley.com/doi/10.1002/zoo.1430050209/abstract' target='_blank'> <i>Pedigree analysis by computer simulation</i> </a>"
    }
  ],
  "shelved_projects" : [
    {
      "image": "/media/projects/shelved_projects/scifi_clustering.png",
      "title": "Digital Humanities approach to Science Fiction and Revisionist History",
      "date": "May '17",
      "description": "In response to theoretical work by James Baldwin and Octavia Butler's <i>Kindred</i>, I proposed an experiment with a corpus of Science Fiction texts to test the hypothesis that Science Fiction writers, particularly African American Science Fiction writers attempt to reclaim lost history by writing about it, and in doing so are undertaking an extensive Revisionist History.",
      "link": "/projects/shelved_projects/scifi_clustering.pdf",
      "image_citation":"Image taken from <a href='https://www.muxima.net/octavia-e-butlers-afrofuturism-masterpiece-kindred-gets-adapted-graphic-novel/' target='_blank'>Muxima</a>"
    },
    {
      "image": "/media/projects/shelved_projects/autocomplete.gif",
      "title": "Autocomplete tool for Journalists",
      "date": "November '15",
      "description": "A partner and I conceptualized a design for an autocomplete tool that would help Journalists with faster notetaking. The system uses a simple Maximum Likelihood based Language Model.",
      "link": "/projects/shelved_projects/autocomplete.pdf",
      "image_citation": "Image taken from <a href='https://www.pakistantoday.com.pk/2018/01/29/draft-of-protection-of-journalists-bill-finalised/' target='_blank'>Pakistan Today</a>"
    }
  ]

}
